df<-read.csv("C:/Rwork/06_국민건강보험공단500.csv")

names(df)
# 필요할 열 추출하여 열명 변경
df1<-df %>% select("시도코드","성별코드","수축기.혈압","이완기.혈압","식전혈당.공복혈당.", "트리글리세라이드","HDL.콜레스테롤","허리둘레")
names(df1)<-c("시도코드", "성별코드", "수축기혈압","이완기혈압", "공복혈당","트리글리세라이드","HDL콜레스테롤","허리둘레")

# 결측치 확인
summary(df1)
# 결측치 자료 모두 삭제
df1<-na.omit(df1)

df1$높은혈압<-ifelse(df1$수축기혈압>=130 & df1$이완기혈압 >=85, 1,0)
df1$높은혈당<-ifelse(df1$공복혈당>=100 , 1 ,0)                
df1$높은중성지방<-ifelse(df1$트리글리세라이드>=150,1,0)
df1$낮은콜레스테롤수치<-ifelse(df1$성별코드==1 & df1$HDL콜레스테롤<40
                      | df1$성별코드==2 & df1$HDL콜레스테롤<50 ,1,0)

df1$복부비만<-ifelse(df1$성별코드==1 & df1$허리둘레>=90
                 | df1$성별코드==2 & df1$허리둘레 >=85,1,0)


df1$대사증후군 <-df1$높은혈압+df1$높은혈당+df1$높은중성지방+df1$낮은콜레스테롤수치
                  + df1$복부비만


df1$대사증후군판별 <-ifelse(df1$대사증후군==0 ,"정상",
                     ifelse(df1$대사증후군<=2, "주의군","위험군"))

# 판별하는 지도학습모델 만들고 정확도
install.packages("party")
library(party)

ta<-df1[,c("")]



formula <-df1$대사증후군 ~df1$높은혈당+df1$높은중성지방+df1$낮은콜레스테롤수치
+ df1$복부비만

ds_ctree<-ctree(formula, data=df1)



